In [263]:
# Unit 2 | Homework Assignment: Automate Your Day Job with Python

In [264]:
## Background

In [265]:
## PyBank (Required)

In [266]:
![Revenue](Images/revenue-per-lead.jpg)

zsh:1: number expected

In [267]:
import pandas as pd

In [268]:
Financial_Analysis_df=pd.read_csv("PyBank_data.csv")
Financial_Analysis_df.head()

     Date  Profit/Losses
0  10-Jan         867884
1  10-Feb         984655
2  10-Mar         322013
3  10-Apr         -69417
4  10-May         310503

In [269]:
Financial_Analysis_df.isnull().sum()

Date             0
Profit/Losses    0
dtype: int64

In [270]:
Financial_Analysis_df.dtypes

Date             object
Profit/Losses     int64
dtype: object

In [271]:
Financial_Analysis_df["Profit/Losses"]=Financial_Analysis_df["Profit/Losses"].astype("float")
Financial_Analysis_df

      Date  Profit/Losses
0   10-Jan    $867,884.00
1   10-Feb    $984,655.00
2   10-Mar    $322,013.00
3   10-Apr    $-69,417.00
4   10-May    $310,503.00
..     ...            ...
81  16-Oct    $102,685.00
82  16-Nov    $795,914.00
83  16-Dec     $60,988.00
84  17-Jan    $138,230.00
85  17-Feb    $671,099.00

[86 rows x 2 columns]

In [272]:
Financial_Analysis_df.dtypes

Date              object
Profit/Losses    float64
dtype: object

In [273]:
#Total Months: = count of all indexed columns in date

In [274]:
Total_months = Financial_Analysis_df["Date"].count() 
Total_months

86

In [275]:
#The net total amount of Profit/Losses over the entire period.

In [276]:
Total = Financial_Analysis_df["Profit/Losses"].sum() 
Total

38382578.0

In [277]:
Financial_Analysis_df["shifted_column"] = Financial_Analysis_df["Profit/Losses"].shift(1)

In [278]:
Financial_Analysis_df

      Date  Profit/Losses  shifted_column
0   10-Jan    $867,884.00            $nan
1   10-Feb    $984,655.00     $867,884.00
2   10-Mar    $322,013.00     $984,655.00
3   10-Apr    $-69,417.00     $322,013.00
4   10-May    $310,503.00     $-69,417.00
..     ...            ...             ...
81  16-Oct    $102,685.00     $768,450.00
82  16-Nov    $795,914.00     $102,685.00
83  16-Dec     $60,988.00     $795,914.00
84  17-Jan    $138,230.00      $60,988.00
85  17-Feb    $671,099.00     $138,230.00

[86 rows x 3 columns]

In [279]:
Financial_Analysis_df["difference"] = Financial_Analysis_df["Profit/Losses"] - Financial_Analysis_df["shifted_column"]
Financial_Analysis_df

      Date  Profit/Losses  shifted_column   difference
0   10-Jan    $867,884.00            $nan         $nan
1   10-Feb    $984,655.00     $867,884.00  $116,771.00
2   10-Mar    $322,013.00     $984,655.00 $-662,642.00
3   10-Apr    $-69,417.00     $322,013.00 $-391,430.00
4   10-May    $310,503.00     $-69,417.00  $379,920.00
..     ...            ...             ...          ...
81  16-Oct    $102,685.00     $768,450.00 $-665,765.00
82  16-Nov    $795,914.00     $102,685.00  $693,229.00
83  16-Dec     $60,988.00     $795,914.00 $-734,926.00
84  17-Jan    $138,230.00      $60,988.00   $77,242.00
85  17-Feb    $671,099.00     $138,230.00  $532,869.00

[86 rows x 4 columns]

In [280]:
average = Financial_Analysis_df["difference"].mean()
maximum = Financial_Analysis_df["difference"].max()
minimum = Financial_Analysis_df["difference"].min()

In [281]:
#The average of the changes in Profit/Losses over the entire period.

In [282]:
'${:0,.2f}'.format(Financial_Analysis_df["difference"].mean())

'$-2,315.12'

In [283]:
#The greatest increase in profits (date and amount) over the entire period.

In [284]:
'${:0,.0f}'.format(Financial_Analysis_df["difference"].max())

'$1,926,159'

In [285]:
#The greatest decrease in losses (date and amount) over the entire period.

In [286]:
'${:0,.0f}'.format(Financial_Analysis_df["difference"].min())

'$-2,196,167'

In [287]:
```text
  Financial Analysis
  ----------------------------
  Total Months: 86    #The total number of months included in the dataset.
  Total: $38382578    #The net total amount of Profit/Losses over the entire period.
  Average  Change: $-2315.12    #The average of the changes in Profit/Losses over the entire period.
  Greatest Increase in Profits: Feb-2012 ($1926159)     #The greatest increase in profits (date and amount) over the entire period.
  Greatest Decrease in Profits: Sep-2013 ($-2196167)    #The greatest decrease in losses (date and amount) over the entire period.
  ```

SyntaxError: invalid syntax (<ipython-input-287-316486dda116>, line 1)